driver-tests/httpsoapbc/i18n/HttpSoapBCJbi/test/Operation1ShouldSucceed_Invoke_I18n/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><Elem1 xmlns="http://onewayerrortest.webservice.namespace"><Field1_1 >operation1用のテスト文章</Field1_1><Field1_2 >１２３４</Field1_2><Field1_3 >Operation 1 was invoked.</Field1_3></Elem1></SOAP-ENV:Body></SOAP-ENV:Envelope>